'use strict';
// Напиши функцію filterArray(numbers, value), яка приймає масив чисел (numbers) та значення (value) як параметри. Функція повинна повертати новий масив лише тих чисел із масиву numbers, які більші за значення value.
// Усередині функції:
// Створи порожній масив, у який будеш додавати підходящі числа.
// Використай цикл для ітерації кожного елемента масиву numbers.
// Використовуй умовний оператор if усередині циклу для перевірки кожного елемента и додавання до свого масиву.
// Поверни свій новий масив з підходящими числами як результат.

// цикл фор потім іф

function filterArray(numbers, value) {
  const result = [];
  //console.log('довжина', numbers.length); // довжина масиву
  //console.log('index', numbers[0]); // значення елемента за індексом
  for (let i = 0; i < numbers.length; i++) {
    if (numbers[i] > value) {
      result.push(numbers[i]);
    }
  }

  return result;
}

// для і задаю початковий індекс елементів = 0
// умова (<>) працює поки і (індекс елемента) більше за довжинe масиву
// потім переходжу до наступного індекса елемента - і++
//  мені треба вибрати значення елемента ?!?!?!?!?!
// ?????
// іф значення елемента більша за вельє - то ....??? пуш в результ ???

console.log(filterArray([1, 2, 3, 4, 5], 3)); // [4, 5]
console.log(filterArray([1, 2, 3, 4, 5], 4)); // [5]
console.log(filterArray([1, 2, 3, 4, 5], 5)); // []
console.log(filterArray([12, 24, 8, 41, 76], 38)); // [41, 76]
console.log(filterArray([12, 24, 8, 41, 76], 20)); // [24, 41, 76]
